In [ ]:
#!pip install pymysql
#!pip install sqlalchemy

In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

# Establish a connection between Python and the Sakila database.

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM sakila.rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

# Python Function Rental_Month

In [6]:
def rentals_month(engine,year,month):
    query = f'''select * from rental
                where year(rental_date) = {year} and month(rental_date) = {month}
                group by rental_id'''
    data = pd.read_sql_query(query, engine)
    return data

In [16]:
rentals_month(engine,2006,2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,11496,2006-02-14 15:16:03,2047,155,None,1,2006-02-15 21:30:53
1,11541,2006-02-14 15:16:03,2026,335,None,1,2006-02-15 21:30:53
2,11563,2006-02-14 15:16:03,1545,83,None,1,2006-02-15 21:30:53
3,11577,2006-02-14 15:16:03,4106,219,None,2,2006-02-15 21:30:53
4,11593,2006-02-14 15:16:03,817,99,None,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
177,15862,2006-02-14 15:16:03,925,215,None,1,2006-02-15 21:30:53
178,15867,2006-02-14 15:16:03,837,505,None,2,2006-02-15 21:30:53
179,15875,2006-02-14 15:16:03,3611,41,None,1,2006-02-15 21:30:53
180,15894,2006-02-14 15:16:03,4416,168,None,1,2006-02-15 21:30:53
181,15966,2006-02-14 15:16:03,4472,374,None,1,2006-02-15 21:30:53

# python function rental_count_month

In [50]:
def rental_count_month(data,year,month):
    filtered_data = data.loc[(data["rental_date"].dt.year == year) & (data['rental_date'].dt.month == month)]
    a = filtered_data.drop(columns = ["inventory_id","return_date","staff_id","last_update"],axis = 1)
    rental_counts = a.groupby('customer_id').count().rename(columns = {"rental_id":"count_rental_id","rental_date":f"rental_{year}_{month}"})
    return rental_counts

In [51]:
rental_count_month(data,2005,5)

             count_rental_id  rental_2005_5
customer_id
1                          2              2
2                          1              1
3                          2              2
5                          3              3
6                          3              3
...                      ...            ...
594                        4              4
595                        1              1
596                        6              6
597                        2              2
599                        1              1

[520 rows x 2 columns]

In [69]:
query_month = '''select distinct customer_id,count(rental_id) ,month(rental_date) as M, year(rental_date) as Y 
                from rental 
                where (month(rental_date) = 5) & (year(rental_date) = 2005)
                group by customer_id, M,Y
                order by customer_id desc'''

In [71]:
month = 5
year =2005
df_4_m = pd.read_sql(query_month,engine)
df_4_m

     customer_id  count(rental_id)  M     Y
0            599                 1  5  2005
1            597                 2  5  2005
2            596                 6  5  2005
3            595                 1  5  2005
4            594                 4  5  2005
..           ...               ... ..   ...
515            6                 3  5  2005
516            5                 3  5  2005
517            3                 2  5  2005
518            2                 1  5  2005
519            1                 2  5  2005

[520 rows x 4 columns]

#Python function called compare_rentals

In [ ]:
# function input_month1 and input_month2 are the two functions in which we can give values of month and 
# year of which we want to find the difference of number of rentals for same customer id

In [78]:
def input_month1(engine,year,month):
    query_m_1 = f'''select distinct customer_id,count(rental_id) ,month(rental_date) as M, year(rental_date) as Y 
                from rental 
                where (month(rental_date) = {month}) & (year(rental_date) = {year})
                group by customer_id, M,Y
                order by customer_id desc'''
    data_1 = pd.read_sql_query(query_m_1, engine)
    return data_1

In [82]:
data_1 = input_month1(engine,2005,5) 
# month = "May" and year =2005--- data frame1 which will go as a parameter for function compare rental

In [74]:
def input_month2(engine,year,month):
    query_m_2 = f'''select distinct customer_id,count(rental_id) ,month(rental_date) as M, year(rental_date) as Y 
                from rental 
                where (month(rental_date) = {month}) & (year(rental_date) = {year})
                group by customer_id, M,Y
                order by customer_id desc'''
    data_2 = pd.read_sql_query(query_m_2, engine)
    return data_2

In [80]:
data_2 = input_month2(engine,2006,2)
## month = "february" and year =2006--- data frame2 which will go as a parameter for function compare rental

In [89]:
def compare_rentals(data_1,data_2):
    merged_df = pd.merge(data_1, data_2, on="customer_id", how="inner")
    merged_df = merged_df.fillna(0)

    # Calculate the difference between the two months
    merged_df['difference'] = merged_df['count(rental_id)_x'] - merged_df['count(rental_id)_y']
    return merged_df

In [91]:
compare_rentals(data_1,data_2)

,customer_id,count(rental_id)_x,M_x,Y_x,count(rental_id)_y,M_y,Y_y,difference
0,597,2,5,2005,1,2,2006,1
1,596,6,5,2005,1,2,2006,5
2,590,1,5,2005,1,2,2006,0
3,587,2,5,2005,1,2,2006,1
4,582,1,5,2005,1,2,2006,0
...,...,...,...,...,...,...,...,...
134,21,3,5,2005,1,2,2006,2
135,14,5,5,2005,1,2,2006,4
136,11,1,5,2005,1,2,2006,0
137,9,3,5,2005,1,2,2006,2
138,5,3,5,2005,1,2,2006,2